src/test/resources/requests/weather/schemaErrorTypeWrong.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://www.codecentric.de/namespace/weatherservice/general">
   <soapenv:Header/>
   <soapenv:Body>
      <gen:GetCityForecastByZIP>
         <gen:ForecastRequest>
            <gen:ZIP>9327</gen:ZIP>
            <gen:flagcolor>Red</gen:flagcolor>
            <gen:productName>Product</gen:productName>
            <gen:ForecastCustomer>
               <gen:Age>s</gen:Age>
               <gen:Contribution>3</gen:Contribution>
               <gen:MethodOfPayment>CC</gen:MethodOfPayment>
            </gen:ForecastCustomer>
         </gen:ForecastRequest>
      </gen:GetCityForecastByZIP>
   </soapenv:Body>
</soapenv:Envelope>